x1=0.1:0.01:100;
if x1<=1
  z1=59.952*log(8./x1+x1./4);
else
  z1=(119.904*pi)./(x1+2.42-0.44./x1+(1-1./x1).^6);
end
e1=(2.1+1)/2+(2.1-1)/2*(1+12./x1).^(-1/2);
z01=z1./sqrt(e1);
plot(x1,z01,'c');
xlabel('w/h');
ylabel('z0');
title('微带线特性阻抗变化曲线');
grid on;
hold on;

x2=0.1:0.01:100;
if x2<=1
  z2=59.952*log(8./x2+x2./4);
else
  z2=(119.904*pi)./(x2+2.42-0.44./x2+(1-1./x2).^6);
end
e2=(4.8+1)/2+(4.8-1)/2*(1+12./x2).^(-1/2);
z02=z2./sqrt(e2);
plot(x2,z02,'k');
grid on;
hold on;

x3=0.1:0.01:100;
if x3<=1
  z3=59.952*log(8./x3+x3./4);
else
  z3=(119.904*pi)./(x3+2.42-0.44./x3+(1-1./x3).^6);
end
e3=(6.8+1)/2+(6.8-1)/2*(1+12./x2).^(-1/2);
z03=z3./sqrt(e3);
plot(x3,z03,'m');
grid on;
hold on;

x4=0.1:0.01:100;
if x4<=1
  z4=59.952*log(8./x4+x4./4);
else
  z4=(119.904*pi)./(x4+2.42-0.44./x4+(1-1./x4).^6);
end
e4=(9.6+1)/2+(9.6-1)/2*(1+12./x4).^(-1/2);
z04=z4./sqrt(e4);
plot(x4,z04,'g');
grid on;
hold on;

x5=0.1:0.01:100;
if x5<=1
  z5=59.952*log(8./x5+x5./4);
else
  z5=(119.904*pi)./(x5+2.42-0.44./x5+(1-1./x5).^6);
end
e5=(12.3+1)/2+(12.3-1)/2*(1+12./x5).^(-1/2);
z05=z5./sqrt(e5);
plot(x5,z05,'r');
legend('Er=2.1','Er=4.8','Er=6.8','Er=9.6','Er=12.3')
grid on;
hold on;
xlabel('w/b');%设置横轴坐标
ylabel('Z0');%设置纵轴坐标
get(gca);
set(gca,'xtick',0:10:100);%横坐标间隔
set(gca,'ytick',0:50:200);%纵坐标间隔
x1=0.1:0.01:100;
if x1<=1
  z1=59.952*log(8./x1+x1./4);
else
  z1=(119.904*pi)./(x1+2.42-0.44./x1+(1-1./x1).^6);
end
e1=(2.1+1)/2+(2.1-1)/2*(1+12./x1).^(-1/2);
z01=z1./sqrt(e1);
plot(x1,z01,'c');
xlabel('w/h');
ylabel('z0');
title('微带线特性阻抗变化曲线');
grid on;
hold on;

x2=0.1:0.01:100;
if x2<=1
  z2=59.952*log(8./x2+x2./4);
else
  z2=(119.904*pi)./(x2+2.42-0.44./x2+(1-1./x2).^6);
end
e2=(4.8+1)/2+(4.8-1)/2*(1+12./x2).^(-1/2);
z02=z2./sqrt(e2);
plot(x2,z02,'k');
grid on;
hold on;

x3=0.1:0.01:100;
if x3<=1
  z3=59.952*log(8./x3+x3./4);
else
  z3=(119.904*pi)./(x3+2.42-0.44./x3+(1-1./x3).^6);
end
e3=(6.8+1)/2+(6.8-1)/2*(1+12./x2).^(-1/2);
z03=z3./sqrt(e3);
plot(x3,z03,'m');
grid on;
hold on;

x4=0.1:0.01:100;
if x4<=1
  z4=59.952*log(8./x4+x4./4);
else
  z4=(119.904*pi)./(x4+2.42-0.44./x4+(1-1./x4).^6);
end
e4=(9.6+1)/2+(9.6-1)/2*(1+12./x4).^(-1/2);
z04=z4./sqrt(e4);
plot(x4,z04,'g');
grid on;
hold on;

x5=0.1:0.01:100;
if x5<=1
  z5=59.952*log(8./x5+x5./4);
else
  z5=(119.904*pi)./(x5+2.42-0.44./x5+(1-1./x5).^6);
end
e5=(12.3+1)/2+(12.3-1)/2*(1+12./x5).^(-1/2);
z05=z5./sqrt(e5);
plot(x5,z05,'r');
legend('Er=2.1','Er=4.8','Er=6.8','Er=9.6','Er=12.3')
grid on;
hold on;
xlabel('w/b');%设置横轴坐标
ylabel('Z0');%设置纵轴坐标
get(gca);
set(gca,'xtick',0:10:100);%横坐标间隔
set(gca,'ytick',0:50:200);%纵坐标间隔
